### apps-devstg/databases-mysql


**$leverage tf init**
```
[13:27:01]    INFO Attempting to get temporary credentials for apps-devstg account.
[13:27:03]    INFO Using already configured temporary credentials.
[13:27:03]    INFO Attempting to get temporary credentials for shared account.
[13:27:06]    INFO Using already configured temporary credentials.
Initializing modules...
Downloading git::https://github.com/binbashar/terraform-aws-rds.git?ref=v4.2.0 for bb_mysql_db...
- bb_mysql_db in .terraform/modules/bb_mysql_db
- bb_mysql_db.db_instance in .terraform/modules/bb_mysql_db/modules/db_instance
- bb_mysql_db.db_option_group in .terraform/modules/bb_mysql_db/modules/db_option_group
- bb_mysql_db.db_parameter_group in .terraform/modules/bb_mysql_db/modules/db_parameter_group
- bb_mysql_db.db_subnet_group in .terraform/modules/bb_mysql_db/modules/db_subnet_group

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding hashicorp/aws versions matching ">= 3.62.0, >= 4.0.0, ~> 4.0"...
- Finding hashicorp/vault versions matching "~> 3.6.0"...
- Finding hashicorp/random versions matching ">= 3.1.0"...
- Installing hashicorp/aws v4.15.1...
- Installed hashicorp/aws v4.15.1 (signed by HashiCorp)
- Installing hashicorp/vault v3.6.0...
- Installed hashicorp/vault v3.6.0 (signed by HashiCorp)
- Installing hashicorp/random v3.2.0...
- Installed hashicorp/random v3.2.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```







**$leverage tf apply**
```
[13:37:11]    INFO Attempting to get temporary credentials for apps-devstg account.
[13:37:13]    INFO Using already configured temporary credentials.
[13:37:13]    INFO Attempting to get temporary credentials for shared account.
[13:37:16]    INFO Using already configured temporary credentials.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.bb_mysql_db will be created
  + resource "aws_security_group" "bb_mysql_db" {
      + arn                    = (known after apply)
      + description            = "Binbash Reference MySQL DB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bb_mysql_db"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-072f329fed6757e95"
    }

  # aws_security_group_rule.allow_mysql_port will be created
  + resource "aws_security_group_rule" "allow_mysql_port" {
      + cidr_blocks              = [
          + "172.18.32.0/20",
          + "172.18.0.0/20",
        ]
      + description              = "Allow PostgreSQL from DevStg and Shared"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.bb_mysql_db.random_password.master_password[0] will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.bb_mysql_db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 100
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 14
      + backup_window                         = "00:00-02:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "bb_devstg_binbash_mysql"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.21"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "bb-apps-devstg-binbash-mysql"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.m5.large"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "tue:03:00-tue:06:00"
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + tags_all                              = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + username                              = "administrator"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "bb-apps-devstg-binbash-mysql"
        }
    }

  # module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = (known after apply)
      + name_prefix              = "bb-apps-devstg-binbash-mysql-"
      + option_group_description = "bb-apps-devstg-binbash-mysql option group"
      + tags                     = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
      + tags_all                 = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }

      + timeouts {}
    }

  # module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "bb-apps-devstg-binbash-mysql parameter group"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "bb-apps-devstg-binbash-mysql-"
      + tags        = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
    }

  # module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "bb-apps-devstg-binbash-mysql subnet group"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "bb-apps-devstg-binbash-mysql-"
      + subnet_ids  = [
          + "subnet-05d75d908f61d35e5",
          + "subnet-094c287defbc07180",
          + "subnet-0cec521de70ee76a3",
        ]
      + tags        = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "Backup"      = "True"
          + "Environment" = "apps-devstg"
          + "Name"        = "bb-apps-devstg-binbash-mysql"
          + "Terraform"   = "true"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bb_reference_db_id = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.bb_mysql_db.random_password.master_password[0]: Creating...
module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0]: Creating...
module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0]: Creation complete after 0s [id=J2e8Qg]
module.bb_mysql_db.random_password.master_password[0]: Creation complete after 0s [id=none]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Creating...
module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0]: Creating...
aws_security_group.bb_mysql_db: Creating...
module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Creating...
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Creation complete after 2s [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002]
module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0]: Creation complete after 3s [id=bb-apps-devstg-binbash-mysql-20220521133813198500000001]
module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Creation complete after 3s [id=bb-apps-devstg-binbash-mysql-20220521133813213000000003]
aws_security_group.bb_mysql_db: Creation complete after 4s [id=sg-0a4feb47aeb6e1092]
aws_security_group_rule.allow_mysql_port: Creating...
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Creating...
aws_security_group_rule.allow_mysql_port: Creation complete after 1s [id=sgrule-4093991105]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [10s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [20s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [30s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [40s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [50s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m0s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m10s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [1m20s elapsed]
.
.
.
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [17m9s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still creating... [17m19s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Creation complete after 17m27s [id=bb-apps-devstg-binbash-mysql]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 8 added, 0 changed, 0 destroyed.
Outputs:
bb_reference_db_id = "bb-apps-devstg-binbash-mysql"


```






**$leverage tf destroy**
```
[14:51:11]    INFO Attempting to get temporary credentials for apps-devstg account.
[14:51:22]    INFO Credentials for apps-devstg account written successfully.
[14:51:22]    INFO Attempting to get temporary credentials for shared account.
[14:51:33]    INFO Credentials for shared account written successfully.
Acquiring state lock. This may take a few moments...
module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=J2e8Qg]
module.bb_mysql_db.random_password.master_password[0]: Refreshing state... [id=none]
aws_security_group.bb_mysql_db: Refreshing state... [id=sg-0a4feb47aeb6e1092]
module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=bb-apps-devstg-binbash-mysql-20220521133813198500000001]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002]
module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=bb-apps-devstg-binbash-mysql-20220521133813213000000003]
aws_security_group_rule.allow_mysql_port: Refreshing state... [id=sgrule-4093991105]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=bb-apps-devstg-binbash-mysql]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # aws_security_group.bb_mysql_db will be destroyed
  - resource "aws_security_group" "bb_mysql_db" {
      - arn                    = "arn:aws:ec2:us-east-1:523857393444:security-group/sg-0a4feb47aeb6e1092" -> null
      - description            = "Binbash Reference MySQL DB" -> null
      - egress                 = [] -> null
      - id                     = "sg-0a4feb47aeb6e1092" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "172.18.32.0/20",
                  - "172.18.0.0/20",
                ]
              - description      = "Allow PostgreSQL from DevStg and Shared"
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3306
            },
        ] -> null
      - name                   = "bb_mysql_db" -> null
      - owner_id               = "523857393444" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "apps-devstg"
          - "Terraform"   = "true"
        } -> null
      - tags_all               = {
          - "Environment" = "apps-devstg"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-072f329fed6757e95" -> null
    }

  # aws_security_group_rule.allow_mysql_port will be destroyed
  - resource "aws_security_group_rule" "allow_mysql_port" {
      - cidr_blocks       = [
          - "172.18.32.0/20",
          - "172.18.0.0/20",
        ] -> null
      - description       = "Allow PostgreSQL from DevStg and Shared" -> null
      - from_port         = 3306 -> null
      - id                = "sgrule-4093991105" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0a4feb47aeb6e1092" -> null
      - self              = false -> null
      - to_port           = 3306 -> null
      - type              = "ingress" -> null
    }

  # module.bb_mysql_db.random_password.master_password[0] will be destroyed
  - resource "random_password" "master_password" {
      - bcrypt_hash = (sensitive value)
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.bb_mysql_db.module.db_instance.aws_db_instance.this[0] will be destroyed
  - resource "aws_db_instance" "this" {
      - address                               = "bb-apps-devstg-binbash-mysql.ckbbnvlhvanz.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 100 -> null
      - allow_major_version_upgrade           = false -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-east-1:523857393444:db:bb-apps-devstg-binbash-mysql" -> null
      - auto_minor_version_upgrade            = false -> null
      - availability_zone                     = "us-east-1c" -> null
      - backup_retention_period               = 14 -> null
      - backup_window                         = "00:00-02:00" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - character_set_name                    = "" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - db_name                               = "bb_devstg_binbash_mysql" -> null
      - db_subnet_group_name                  = "bb-apps-devstg-binbash-mysql-20220521133813198500000001" -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - domain                                = "" -> null
      - domain_iam_role_name                  = "" -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "bb-apps-devstg-binbash-mysql.ckbbnvlhvanz.us-east-1.rds.amazonaws.com:3306" -> null
      - engine                                = "mysql" -> null
      - engine_version                        = "8.0.21" -> null
      - engine_version_actual                 = "8.0.21" -> null
      - final_snapshot_identifier             = "final-bb-apps-devstg-binbash-mysql-2767bc42" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "bb-apps-devstg-binbash-mysql" -> null
      - identifier                            = "bb-apps-devstg-binbash-mysql" -> null
      - identifier_prefix                     = "" -> null
      - instance_class                        = "db.m5.large" -> null
      - iops                                  = 0 -> null
      - kms_key_id                            = "arn:aws:kms:us-east-1:523857393444:key/b7a1d584-29cf-4f21-a69f-57ca8eaa1c77" -> null
      - latest_restorable_time                = "2022-05-21T14:50:00Z" -> null
      - license_model                         = "general-public-license" -> null
      - maintenance_window                    = "tue:03:00-tue:06:00" -> null
      - max_allocated_storage                 = 0 -> null
      - monitoring_interval                   = 0 -> null
      - monitoring_role_arn                   = "" -> null
      - multi_az                              = true -> null
      - name                                  = "bb_devstg_binbash_mysql" -> null
      - nchar_character_set_name              = "" -> null
      - option_group_name                     = "bb-apps-devstg-binbash-mysql-20220521133813199800000002" -> null
      - parameter_group_name                  = "bb-apps-devstg-binbash-mysql-20220521133813213000000003" -> null
      - password                              = (sensitive value)
      - performance_insights_enabled          = false -> null
      - performance_insights_kms_key_id       = "" -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 3306 -> null
      - publicly_accessible                   = false -> null
      - replica_mode                          = "" -> null
      - replicas                              = [] -> null
      - replicate_source_db                   = "" -> null
      - resource_id                           = "db-66HFUYVJVSGQ3O7RTGEOH735EE" -> null
      - security_group_names                  = [] -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_type                          = "gp2" -> null
      - tags                                  = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Terraform"   = "true"
        } -> null
      - tags_all                              = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Terraform"   = "true"
        } -> null
      - timezone                              = "" -> null
      - username                              = "administrator" -> null
      - vpc_security_group_ids                = [
          - "sg-0a4feb47aeb6e1092",
        ] -> null

      - timeouts {}
    }

  # module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0] will be destroyed
  - resource "random_id" "snapshot_identifier" {
      - b64_std     = "J2e8Qg==" -> null
      - b64_url     = "J2e8Qg" -> null
      - byte_length = 4 -> null
      - dec         = "661109826" -> null
      - hex         = "2767bc42" -> null
      - id          = "J2e8Qg" -> null
      - keepers     = {
          - "id" = "bb-apps-devstg-binbash-mysql"
        } -> null
    }

  # module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0] will be destroyed
  - resource "aws_db_option_group" "this" {
      - arn                      = "arn:aws:rds:us-east-1:523857393444:og:bb-apps-devstg-binbash-mysql-20220521133813199800000002" -> null
      - engine_name              = "mysql" -> null
      - id                       = "bb-apps-devstg-binbash-mysql-20220521133813199800000002" -> null
      - major_engine_version     = "8.0" -> null
      - name                     = "bb-apps-devstg-binbash-mysql-20220521133813199800000002" -> null
      - name_prefix              = "bb-apps-devstg-binbash-mysql-" -> null
      - option_group_description = "bb-apps-devstg-binbash-mysql option group" -> null
      - tags                     = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Name"        = "bb-apps-devstg-binbash-mysql"
          - "Terraform"   = "true"
        } -> null
      - tags_all                 = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Name"        = "bb-apps-devstg-binbash-mysql"
          - "Terraform"   = "true"
        } -> null

      - timeouts {}
    }

  # module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0] will be destroyed
  - resource "aws_db_parameter_group" "this" {
      - arn         = "arn:aws:rds:us-east-1:523857393444:pg:bb-apps-devstg-binbash-mysql-20220521133813213000000003" -> null
      - description = "bb-apps-devstg-binbash-mysql parameter group" -> null
      - family      = "mysql8.0" -> null
      - id          = "bb-apps-devstg-binbash-mysql-20220521133813213000000003" -> null
      - name        = "bb-apps-devstg-binbash-mysql-20220521133813213000000003" -> null
      - name_prefix = "bb-apps-devstg-binbash-mysql-" -> null
      - tags        = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Name"        = "bb-apps-devstg-binbash-mysql"
          - "Terraform"   = "true"
        } -> null
      - tags_all    = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Name"        = "bb-apps-devstg-binbash-mysql"
          - "Terraform"   = "true"
        } -> null
    }

  # module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0] will be destroyed
  - resource "aws_db_subnet_group" "this" {
      - arn         = "arn:aws:rds:us-east-1:523857393444:subgrp:bb-apps-devstg-binbash-mysql-20220521133813198500000001" -> null
      - description = "bb-apps-devstg-binbash-mysql subnet group" -> null
      - id          = "bb-apps-devstg-binbash-mysql-20220521133813198500000001" -> null
      - name        = "bb-apps-devstg-binbash-mysql-20220521133813198500000001" -> null
      - name_prefix = "bb-apps-devstg-binbash-mysql-" -> null
      - subnet_ids  = [
          - "subnet-05d75d908f61d35e5",
          - "subnet-094c287defbc07180",
          - "subnet-0cec521de70ee76a3",
        ] -> null
      - tags        = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Name"        = "bb-apps-devstg-binbash-mysql"
          - "Terraform"   = "true"
        } -> null
      - tags_all    = {
          - "Backup"      = "True"
          - "Environment" = "apps-devstg"
          - "Name"        = "bb-apps-devstg-binbash-mysql"
          - "Terraform"   = "true"
        } -> null
    }

Plan: 0 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  - bb_reference_db_id = "bb-apps-devstg-binbash-mysql" -> null

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

aws_security_group_rule.allow_mysql_port: Destroying... [id=sgrule-4093991105]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Destroying... [id=bb-apps-devstg-binbash-mysql]
aws_security_group_rule.allow_mysql_port: Destruction complete after 1s
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 10s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 20s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 30s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 40s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 50s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 1m0s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 1m10s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 1m20s elapsed]
.
.
.
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 12m0s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql, 12m10s elapsed]
module.bb_mysql_db.module.db_instance.aws_db_instance.this[0]: Destruction complete after 12m14s
aws_security_group.bb_mysql_db: Destroying... [id=sg-0a4feb47aeb6e1092]
module.bb_mysql_db.random_password.master_password[0]: Destroying... [id=none]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002]
module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813213000000003]
module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0]: Destroying... [id=J2e8Qg]
module.bb_mysql_db.random_password.master_password[0]: Destruction complete after 0s
module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0]: Destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813198500000001]
module.bb_mysql_db.module.db_instance.random_id.snapshot_identifier[0]: Destruction complete after 0s
module.bb_mysql_db.module.db_subnet_group.aws_db_subnet_group.this[0]: Destruction complete after 1s
module.bb_mysql_db.module.db_parameter_group.aws_db_parameter_group.this[0]: Destruction complete after 1s
aws_security_group.bb_mysql_db: Destruction complete after 2s
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 10s elapsed]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 20s elapsed]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 30s elapsed]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 40s elapsed]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 50s elapsed]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 1m0s elapsed]
.
.
.
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 3m40s elapsed]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Still destroying... [id=bb-apps-devstg-binbash-mysql-20220521133813199800000002, 3m50s elapsed]
module.bb_mysql_db.module.db_option_group.aws_db_option_group.this[0]: Destruction complete after 3m50s
Releasing state lock. This may take a few moments...

Destroy complete! Resources: 8 destroyed.

```
